---
kind: property
id: P:Autodesk.Revit.DB.BIMExportOptions.ViewId
source: html/a5864496-b5d0-a1be-ca12-125b7ce9b40d.htm
---
# Autodesk.Revit.DB.BIMExportOptions.ViewId Property

The element id of the 3D view to export. InvalidElementId by default.

## Syntax (C#)
```csharp
public ElementId ViewId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null